# ElementReversed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..ElementReversed Property
BuiltInFailures..::..EditingFailures Class See Also
---
Element is reversed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementReversed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementReversed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementReversed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace